even-developers-can-present.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>(Even Developers can Present)</title>
<meta name="author" content="(John Stevenson)"/>
<link rel="stylesheet" href="./css/reveal.min.css"/>
<link rel="stylesheet" href="./css/theme/jr0cket.css" id="theme"/>

<link rel="stylesheet" href="./css/print/pdf.css" type="text/css" media="print"/>
<meta name="description" content="Even Developers can Present">
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<h1>Even Developers can Present</h1>
<h2>John Stevenson</h2>
<h2><a href="mailto:john@jr0cket.co.uk">john@jr0cket.co.uk</a></h2>
<h2></h2></section>

<section>
<section id="sec-1" >

<h2>We Developers are very social</h2>
</section>
<section id="sec-1-1" >

<h3>No really we are !!</h3>
<p>
In no way are we shy, awkward, introverted&#x2026;
</p>
</section>
<section id="sec-1-2" >

<h3>Well not when we are sufficiently motivated</h3>
<ul class="org-ul">
<li class="fragment roll-in">so find some motivation to talk!
</li>
</ul>
</section>

</section>
<section>
<section id="sec-2" >

<h2>Finding motivation</h2>
<p>
This is probably the hardest thing to do
</p>
<ul class="org-ul">
<li>if you are not motivated its easy to put it off
</li>
</ul>

</section>
<section id="sec-2-1" >

<h3>Think about what excites you (technically)</h3>
<ul class="org-ul">
<li>What languages do you love?
</li>
<li>What frameworks do you worship?
</li>
<li>What tools would you trade your family for?
</li>
<li>What did you learn at work today?
</li>
</ul>

</section>
<section id="sec-2-2" >

<h3>What do you work on that you dont get paid for</h3>
<p>
What would you like to get paid to do that you currently dont!
</p>
</section>
<section id="sec-2-3" >

<h3>What do you talk to your friends about</h3>
<ul class="org-ul">
<li>what are they tired of you banging on about?
</li>
</ul>

<p>
Lots of other people will be interested in that
</p>
</section>
<section id="sec-2-4" >

<h3>Share your ideas and stories at meetups</h3>
<p>
See what topics you feel comfortable talking about at events
</p>
</section>
<section id="sec-2-5" >

<h3>What ever interests you, some other developers out there will also find interesting</h3>
</section>

</section>
<section>
<section id="sec-3" >

<h2>Realise you have something to Say</h2>
<p>
Developers want to hear experiences from other Developers
</p>

</section>
<section id="sec-3-1" >

<h3>In the land of the blind&#x2026;</h3>
<p>
&#x2026; the one eyed man is king
</p>

<ul class="org-ul">
<li>We all have things we dont know much about
</li>
<li>We all have gaps in our knowledge and experience
</li>
<li>Software Development is too big to know everything
</li>
</ul>
</section>
<section id="sec-3-2" >

<h3>Most Developers will be interested in most of what you want to say</h3>
</section>
</section>
<section>
<section id="sec-4" >

<h2>Keep to the point</h2>
</section>
<section id="sec-4-1" >

<h3>Start with a Lightning talk</h3>
<ul class="org-ul">
<li>Talk about something specific within 5 minutes
</li>
<li>Realise you will over-run 5 minutes (everyone does) 
</li>
<li>Get some feedback on the content
<ul class="org-ul">
<li>what did developers find interesting
</li>
<li>what do developers want to hear more about 
</li>
</ul>
</li>
</ul>
</section>
<section id="sec-4-2" >

<h3>Have a basic structures</h3>
<p>
You are telling a story, so there is a begining, middle and end 
</p>

<p>
Begining
</p>
<ul class="org-ul">
<li>tell people why the subject is interesting (context)
</li>
</ul>

<p>
Middle
</p>
<ul class="org-ul">
<li>the meat of the story, what happens, how does it happen
</li>
</ul>

<p>
End
</p>
<ul class="org-ul">
<li>what was the point of the story, what should the audience do next
</li>
</ul>
</section>





</section>
<section>
<section id="sec-5" >

<h2>Little details</h2>
<p>
Some tips to get you going
</p>

</section>
<section id="sec-5-1" >

<h3>Just the bare essentials</h3>
<p>
Dont go crazy with slides / bullet-points
</p>
<ul class="org-ul">
<li>just enough to support the story 
</li>
</ul>
</section>
<section id="sec-5-2" >

<h3>Mix up the content</h3>
<p>
Use a mixture of images and text  
</p>
<ul class="org-ul">
<li>different stimuli keeps people engaged
</li>
</ul>
</section>
<section id="sec-5-3" >

<h3>Stay focused on what you are talking about</h3>
<p>
Think about what you are going to say and why you are saying it
</p>

<ul class="org-ul">
<li>everything else is irrelevant
</li>
</ul>
</section>
<section id="sec-5-4" >

<h3>Projectors are not your friends</h3>
<p>
Check your presentation on every projector you meet
</p>
<ul class="org-ul">
<li>do it well before you start
</li>
<li>check all the tools you'll use 
</li>
<li>ensure colours of text can be seen
</li>
<li>check font size is big enough
<ul class="org-ul">
<li>sand at the back of the room and look
</li>
</ul>
</li>
<li>learn how to change font sizes quickly 
</li>
</ul>
</section>
<section id="sec-5-5" >

<h3>Keep distracted while you wait to speak</h3>
<ul class="org-ul">
<li>play some music or find other distractions before you start
</li>
<li>check you can change font sizes 
</li>
<li>start writing your presentation (advanced speakers only)
</li>
</ul>
</section>
<section id="sec-5-6" >

<h3>Say "Thank You" at the end</h3>
<p>
Pause afterwards so people know when to clap
</p>
<ul class="org-ul">
<li>remember developers can be a shy bunch, so be patient.
</li>
</ul>
</section>

</section>
<section>
<section id="sec-6" >

<h2>Enjoy it, we are all human</h2>
<p>
Developers are social and friendly
</p>
<ul class="org-ul">
<li>especially to other developers 
</li>
</ul>

<p>
If all else fails, think of the Nike slogan
</p>
</section>
</section>
<section>
<section id="sec-7" >

<h2>Just Do It</h2>
<p>
Thank you&#x2026;.
</p>

<p>
(pause for applause)
</p>
</section>
</section>
</div>
</div>
<script src="./lib/js/head.min.js"></script>
<script src="./js/reveal.min.js"></script>
<script>

        		// Full list of configuration options available here:
        		// https://github.com/hakimel/reveal.js#configuration
        		Reveal.initialize({
        			controls: true,
        			progress: true,
        			history: true,
        			center: false,
        			rollingLinks: true,
        			keyboard: true,
        			overview: true,
        			width: 1600, // slide width
        			height: 900, // slide height
        			 // slide margin
        			 // slide minimum scaling factor
        			 // slide maximum scaling factor


        			theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
        			transition: Reveal.getQueryHash().transition || 'linear', // default/cube/page/concave/zoom/linear/fade/none
        			transitionSpeed: 'default',

        			// Optional libraries used to extend on reveal.js
        			dependencies: [
        				{ src: './lib/js/classList.js', condition: function() { return !document.body.classList; } }
        				,{ src: './plugin/markdown/showdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } }
        				,{ src: './plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } }
        				,{ src: './plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } }
        				,{ src: './plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } }
        				,{ src: './plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }
        				// { src: './plugin/search/search.js', async: true, condition: function() { return !!document.body.classList; } }
        				// { src: './plugin/remotes/remotes.js', async: true, condition: function() { return !!document.body.classList; } }
         				
        			]
        		});
</script>
</body>
</html>
